ГТС/УТГТС/Enums/ТипыЗаписейВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗаписейВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствУвеличениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствУменьшениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствУменьшениеПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженностиУвеличениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженностиУвеличениеПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженностиУменьшениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженностиУменьшениеПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНакладнойУвеличениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНакладнойУвеличениеПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНакладнойУменьшениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНакладнойУменьшениеПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаУвеличениеПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаУменьшениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаУвеличениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаУменьшениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаУменьшениеПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносВзаиморасчетовУвеличениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносВзаиморасчетовУвеличениеПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносВзаиморасчетовУменьшениеДолга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносВзаиморасчетовУменьшениеПредоплаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ОперацииВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОперацииВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНакладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыЗаписейВзаиморасчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет тип записи взаиморасчетов по операции взаиморасчетов
// 
// Параметры:
//  ОперацияВзаиморасчетов - ПеречислениеСсылка.ОперацииВзаиморасчетов - Операция взаиморасчетов
//  ЭтоПредоплата - Булево - Предоплата или долг записи
//  ВидДвижения - ВидДвиженияНакопления - Вид движения записи
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыЗаписейВзаиморасчетов - Тип записи по операции
Функция ТипЗаписиПоОперации(ОперацияВзаиморасчетов, ЭтоПредоплата, ВидДвижения) Экспорт
	
	Если ВидДвижения = ВидДвиженияНакопления.Приход Тогда
		Если ЭтоПредоплата Тогда
			Если ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Оплата Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ОплатаУвеличениеПредоплаты;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаНакладной Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУвеличениеПредоплаты;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ПереносВзаиморасчетов Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУвеличениеПредоплаты;
			Иначе
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеПредоплаты;
			КонецЕсли;
		Иначе
			Если ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Отгрузка Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ОтгрузкаУвеличениеДолга;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаНакладной Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУвеличениеДолга;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ВозвратДенежныхСредств Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ВозвратДенежныхСредствУвеличениеДолга;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ПереносВзаиморасчетов Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУвеличениеДолга;
			Иначе
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеДолга;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЭтоПредоплата Тогда
			Если ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Отгрузка Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ОтгрузкаУменьшениеПредоплаты;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаНакладной Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУменьшениеПредоплаты;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ВозвратДенежныхСредств Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ВозвратДенежныхСредствУменьшениеПредоплаты;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ПереносВзаиморасчетов Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУменьшениеПредоплаты;
			Иначе
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеПредоплаты;
			КонецЕсли;
		Иначе
			Если ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Оплата Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ОплатаУменьшениеДолга;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Отгрузка Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ОтгрузкаУменьшениеДолга;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаНакладной Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУменьшениеДолга;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ВозвратДенежныхСредств Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ВозвратДенежныхСредствУменьшениеДолга;
			ИначеЕсли ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ПереносВзаиморасчетов Тогда
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУменьшениеДолга;
			Иначе
				Возврат Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеДолга;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
